---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.ElementsNotAllowedAreNotAddedToAssembly
source: html/ae448d4b-8fb8-449a-7059-51c105fe73a9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.ElementsNotAllowedAreNotAddedToAssembly Property

Elements not allowed in Assembly were not added to it, but only in the document

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsNotAllowedAreNotAddedToAssembly { get; }
```